import java.util.Scanner;

public class Flowers {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        //На първия ред е броят на закупените хризантеми – цяло число в интервала [0 ... 200]
        //На втория ред е броят на закупените рози – цяло число в интервала [0 ... 200]
        //На третия ред е броят на закупените лалета – цяло число в интервала [0 ... 200]
        //На четвъртия ред е посочен сезона – [Spring, Summer, Аutumn, Winter]
        //На петия ред е посочено дали денят е празник – [Y – да / N - не]
        int hrysantemesNum = Integer.parseInt(input.nextLine());
        int rosesNum = Integer.parseInt(input.nextLine());
        int tulupsNum = Integer.parseInt(input.nextLine());
        String season = input.nextLine();
        String hiliday = input.nextLine();


        double total = 0.0;
        //Цената за аранжиране на букета винаги е 2лв
        switch (season) {
            case "Spring":
                //Сезон             Хризантеми        Рози              Лалета
                //Пролет / Лято     2.00 лв./бр.      4.10 лв./бр.      2.50 лв./бр.
                //В празнични дни цените на всички цветя се увеличават с +15%.
                //За закупени повече от 7 лалета през пролетта – -5% от цената на целият букет.
                //За закупени повече от 20 цветя общо през всички сезони – -20% от цената на целият букет.
                //Отстъпките се правят по така написания ред и могат да се наслагват! Всички отстъпки важат след оскъпяването за празничен ден!
                total = total + hrysantemesNum * 2.00 + rosesNum * 4.10 + tulupsNum * 2.5;
                if (hiliday.equals("Y")) {
                    total = total * 1.15;
                }
                if (tulupsNum > 7) {
                    total = total * 0.95;
                }
                if (hrysantemesNum + rosesNum + tulupsNum > 20) {
                    total = total * 0.8;
                }
                break;
            case "Summer":
                //Сезон             Хризантеми        Рози              Лалета
                //Пролет / Лято     2.00 лв./бр.      4.10 лв./бр.      2.50 лв./бр.
                //В празнични дни цените на всички цветя се увеличават с +15%.
                //За закупени повече от 20 цветя общо през всички сезони – -20% от цената на целият букет.
                //Отстъпките се правят по така написания ред и могат да се наслагват! Всички отстъпки важат след оскъпяването за празничен ден!
                total = total + hrysantemesNum * 2.00 + rosesNum * 4.10 + tulupsNum * 2.5;
                if (hiliday.equals("Y")) {
                    total = total * 1.15;
                }
                if (hrysantemesNum + rosesNum + tulupsNum > 20) {
                    total = total * 0.8;
                }
                break;
            case "Autumn":
                //Сезон             Хризантеми        Рози              Лалета
                //Есен / Зима       3.75 лв./бр.      4.50 лв./бр.      4.15 лв./бр.
                //В празнични дни цените на всички цветя се увеличават с +15%.
                //За закупени повече от 20 цветя общо през всички сезони – -20% от цената на целият букет.
                //Отстъпките се правят по така написания ред и могат да се наслагват! Всички отстъпки важат след оскъпяването за празничен ден!
                total = total + hrysantemesNum * 3.75 + rosesNum * 4.50 + tulupsNum * 4.15;
                if (hiliday.equals("Y")) {
                    total = total * 1.15;
                }
                if (hrysantemesNum + rosesNum + tulupsNum > 20) {
                    total = total * 0.8;
                }
                break;
            case "Winter":
                //Сезон             Хризантеми        Рози              Лалета
                //Есен / Зима       3.75 лв./бр.      4.50 лв./бр.      4.15 лв./бр.
                //В празнични дни цените на всички цветя се увеличават с +15%.
                //За закупени 10 или повече рози през зимата – -10% от цената на целият букет.
                //За закупени повече от 20 цветя общо през всички сезони – -20% от цената на целият букет.
                //Отстъпките се правят по така написания ред и могат да се наслагват! Всички отстъпки важат след оскъпяването за празничен ден!
                total = total + hrysantemesNum * 3.75 + rosesNum * 4.50 + tulupsNum * 4.15;
                if (hiliday.equals("Y")) {
                    total = total * 1.15;
                }
                if (rosesNum >= 10) {
                    total = total * 0.9;
                }
                if (hrysantemesNum + rosesNum + tulupsNum > 20) {
                    total = total * 0.8;
                }
                break;

        }
        //Цената за аранжиране на букета винаги е 2лв
        total = total + 2;
        //Да се отпечата на конзолата 1 число – цената на цветята, форматирана до вторият знак след десетичната запетая.
        System.out.printf("%.2f",total);
    }
}