import java.util.Scanner;

public class TransportPrice {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        //Студент трябва да пропътува n километра. Той има избор измежду три вида транспорт:
        //Такси. Начална такса: 0.70 лв. Дневна тарифа: 0.79 лв. / км. Нощна тарифа: 0.90 лв. / км.
        //Автобус. Дневна / нощна тарифа: 0.09 лв. / км. Може да се използва за разстояния минимум 20 км.
        //Влак. Дневна / нощна тарифа: 0.06 лв. / км. Може да се използва за разстояния минимум 100 км.
        //Първият ред съдържа числото n – брой километри – цяло число в интервала [1…5000]
        //Вторият ред съдържа дума “day” или “night” – пътуване през деня или през нощта
        //най-ниската цена за посочения брой километри, форматирана до втория знак след десетичния разделител.

        int n = Integer.parseInt(input.nextLine());
        String d = input.nextLine();
        double sum = 0.0;

        if (n<20) {
            if (d.equals("day")){
                sum = n * 0.79 + 0.7;
            } else if (d.equals("night")){
                sum = n * 0.9 + 0.7;
            }
        } else if (n < 100){
            sum = n * 0.09;
        } else sum = n * 0.06;

        System.out.printf("%.2f", sum);


    }
}
